//***********************************************************************
//* Практическая работа № 6                                             *
//* Выполнила: Кондратюк Е.С., группа 2ИСП                              *
//* Задание: Составление программ разветвляющейся усложненной структуры *
//***********************************************************************
using System;
namespace _24342
{
    internal class Program
    {
        static void Main(string[] args)
        {
            try // блок обработки исключений
            {
                Console.Title = "Практическая работа №6"; // Заголовок
                double a = 0, b = 0, c = 0, d = 0, e = 0, f = 0; // объявление сторон треугольников
                double s1 = 0, s2 = 0, p1 = 0, p2 = 0;   // объявление полупериметров и площадей
                int choice = 0; // объявление выбора пользователя
                Console.BackgroundColor = ConsoleColor.Gray; // изменение цвета фона
                Console.ForegroundColor = ConsoleColor.Black; //изменение цвета шрифта
                Console.Clear(); // очистка мусора
                Console.WriteLine("Здравствуйте!"); // приветствие
                Console.Write("Выберите, с какого треугольника хотите начать: 1 или 2\n"); // вывод вариантов выбора для пользователя
                choice = Convert.ToInt32(Console.ReadLine()); // преобразование в целочисленный тип, переменная choice - выбор пользователя
                switch (choice) // выбор порядка ввода сторон треугольников
                {
                    case 1: // если пользователь сделал выбор 1
                        Console.WriteLine("вы выбрали начать с 1-го треугольника"); // вывод выбора пользователя
                        Console.Write("Введите 1-ю сторону 1-го треугольника: "); // вывод просьбы для ввода стороны треугольника
                        a = Convert.ToDouble(Console.ReadLine()); // ввод стороны a и преобразование в вещественный тип
                        Console.Write("Введите 2-ю сторону 1-го треугольника: "); // вывод просьбы для ввода стороны треугольника
                        b = Convert.ToDouble(Console.ReadLine()); // ввод стороны b и преобразование в вещественный тип
                        Console.Write("Введите 3-ю сторону 1-го треугольника: "); // вывод просьбы для ввода стороны треугольника
                        c = Convert.ToDouble(Console.ReadLine()); // ввод стороны c и преобразование в вещественный тип
                        Console.Write("\nВведите 1-ю сторону 2-го треугольника: "); // вывод просьбы для ввода стороны треугольника
                        d = Convert.ToDouble(Console.ReadLine()); // ввод стороны d и преобразование в вещественный тип
                        Console.Write("Введите 2-ю сторону 2-го треугольника: "); // вывод просьбы для ввода стороны треугольника
                        e = Convert.ToDouble(Console.ReadLine()); // ввод стороны e и преобразование в вещественный тип
                        Console.Write("Введите 3-ю сторону 2-го треугольника: "); // вывод просьбы для ввода стороны треугольника
                        f = Convert.ToDouble(Console.ReadLine()); break; // ввод стороны f и преобразование в вещественный тип, выход из switch
                    case 2: // если пользователь сделал выбор 2
                        Console.WriteLine("вы выбрали начать с 2-го треугольника");  // вывод выбора пользователя
                        Console.Write("Введите 1-ю сторону 2-го треугольника: "); // вывод просьбы для ввода стороны треугольника
                        d = Convert.ToDouble(Console.ReadLine()); // ввод стороны d и преобразование в вещественный тип
                        Console.Write("Введите 2-ю сторону 2-го треугольника: "); // вывод просьбы для ввода стороны треугольника
                        e = Convert.ToDouble(Console.ReadLine()); // ввод стороны e и преобразование в вещественный тип
                        Console.Write("Введите 3-ю сторону 2-го треугольника: "); // вывод просьбы для ввода стороны треугольника
                        f = Convert.ToDouble(Console.ReadLine()); // ввод стороны f и преобразование в вещественный тип
                        Console.Write("\nВведите 1-ю сторону 1-го треугольника: "); // вывод просьбы для ввода стороны треугольника
                        a = Convert.ToDouble(Console.ReadLine()); // ввод стороны a и преобразование в вещественный тип
                        Console.Write("Введите 2-ю сторону 1-го треугольника: "); // вывод просьбы для ввода стороны треугольника
                        b = Convert.ToDouble(Console.ReadLine()); // ввод стороны b и преобразование в вещественный тип
                        Console.Write("Введите 3-ю сторону 1-го треугольника: "); // вывод просьбы для ввода стороны треугольника
                        c = Convert.ToDouble(Console.ReadLine()); break; // ввод стороны с и преобразование в вещественный тип, выход из switch
                    default: // если пользователь сделал выбор иного значения
                        throw new Exception("Вы ввели неправильный номер!"); // исключительное условие для передачи информации об ошибке
                }
                string acheck = (a <= 0).ToString(), bcheck = (b <= 0).ToString(), ccheck = (c <= 0).ToString(), dcheck = (d <= 0).ToString(), echeck = (e <= 0).ToString(), fcheck = (f <= 0).ToString();   // результат проверки сторон треугольников в виде строки
                string zerocheck = acheck + bcheck + ccheck + dcheck + echeck + fcheck; // обьединение результатов в 1 строку
                string sumc = (a + b <= c).ToString(), sumb = (a + c <= b).ToString(), suma = (b + c <= a).ToString(), sumf = (d + e <= f).ToString(), sumd = (e + f <= d).ToString(), sume = (f + d <= e).ToString(); // Результат проверки суммы сторон треугольников
                string sumcheck = sumc + sumb + suma + sumf + sumd + sume; // обьединение результатов в 1 строку
                switch (zerocheck) // проверка: все стороны должны быть > 0
                {
                    case "FalseFalseFalseFalseFalseFalse": break; // если у пользователя все шесть проверок дали "False" при проверке условия (все стороны >0)
                    default: // если у пользователя получился иной результат при проверке условия
                        throw new Exception("Сторона не может быть <= 0"); // исключительное условие для передачи информации об ошибке
                }
                switch (sumcheck) // проверка суммы сторон треугольников: <= большей
                {
                    case "FalseFalseFalseFalseFalseFalse": // если у пользователя все шесть проверок дали "False" (треугольники существуют)
                        p1 = (a + b + c) / 2; // Вычисление полупериметра 1-го треугольника
                        p2 = (d + e + f) / 2; // Вычисление полупериметра 2-го треугольника
                        s1 = Math.Sqrt(p1 * (p1 - a) * (p1 - b) * (p1 - c)); // вычисление площади по формуле Герона для 1-го треугольника
                        s2 = Math.Sqrt(p2 * (p2 - d) * (p2 - e) * (p2 - f)); // вычисление площади по формуле Герона для 2-го треугольника
                        string omparisons1 = (s1 > s2).ToString(), omparisons2 = (s1 < s2).ToString(); // проверка: s1 < s2 и s1 > s2
                        string omparisons12 = omparisons1 + omparisons2; // обьединение результата в 1 строку
                        switch (omparisons12) // проверка площадей
                        {
                            case "FalseFalse":  // если у пользователя все 2 проверки дали "False" (=)
                                Console.WriteLine("Треугольники имеют равные площади");  // вывод результата 
                                break; // выход из switch
                            default: // если у пользователя получился иной результат при проверке условия
                                Console.WriteLine("Треугольники имеют разные площади"); // вывод результата 
                                break; // выход из switch
                        }
                        break; // выход из switch
                    default: // если у пользователя получился иной результат при проверке условия
                        throw new Exception("Такой треугольник не существует."); // исключительное условие для передачи инфомации об ошибке
                }
            }
            catch (Exception ex) // обработка исключений
            {
                Console.WriteLine("Ошибка: " + ex.Message); // вывод сообщения об ошибки
            }
            Console.ReadKey(); // задержка консоли
        }

    }
}